In [11]:
pip install pandas openpyxl

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: openpyxl in c:\users\user\anaconda3\lib\site-packages (3.1.5)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: et-xmlfile in c:\users\user\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [17]:
import pandas as pd
import numpy as np

In [75]:
data = pd.read_excel('Messy data.xlsx')
data.head()
df

   ID     Name   Age               Email             JoinDate    Salary
0   1    Alice  25.0   alice@example.com  2020-01-01 00:00:00   50000.0
1   2      Bob  30.0     bob@example.com           not a date   60000.0
2   2      Bob  30.0     bob@example.com  2020-02-01 00:00:00   60000.0
3   4  Charlie   NaN            charlie@  2020-03-01 00:00:00   70000.0
4   5    David  22.0                 NaN  2020-04-01 00:00:00       NaN
5   6      Eve  45.0         eve@example  2020-05-01 00:00:00   90000.0
6   7    Frank  50.0  frank@@example.com  2020-06-01 00:00:00  100000.0
7   8    Grace  55.0   grace@example.com  2020-07-01 00:00:00  100000.0
8   9    Heidi  60.0   heidi@example.com  2020-08-01 00:00:00  120000.0
9  10      NaN  65.0      10@example.com  2020-09-01 00:00:00  130000.0

In [25]:
print(df.head())  # Shows the first 5 rows

   ID     Name   Age              Email             JoinDate   Salary
0   1    Alice  25.0  alice@example.com  2020-01-01 00:00:00  50000.0
1   2      Bob  30.0    bob@example.com           not a date  60000.0
2   2      Bob  30.0    bob@example.com  2020-02-01 00:00:00  60000.0
3   4  Charlie   NaN           charlie@  2020-03-01 00:00:00  70000.0
4   5    David  22.0                NaN  2020-04-01 00:00:00      NaN

In [35]:
df.isnull()           # Returns True for missing values
df.isnull().sum()     # Count of missing values per column

ID          0
Name        1
Age         1
Email       1
JoinDate    0
Salary      1
dtype: int64

In [103]:
from sklearn.impute import SimpleImputer

In [99]:
imputer = SimpleImputer(strategy='mean')
imputer.fit(data[['Age']]) 
data[['Age']] = imputer.transform(data[['Age']])  # Corrected closing bracket

In [67]:
df.dtypes

ID            int64
Name         object
Age         float64
Email        object
JoinDate     object
Salary      float64
dtype: object

In [56]:
unique_values = df['Age'].unique()
unique_values

array([25., 30., nan, 22., 45., 50., 55., 60., 65.])

In [69]:
duplicates = data.duplicated()
data[duplicates]
data.drop_duplicates(inplace=True)

In [63]:
print(df.head())

   ID     Name   Age              Email             JoinDate   Salary
0   1    Alice  25.0  alice@example.com  2020-01-01 00:00:00  50000.0
1   2      Bob  30.0    bob@example.com           not a date  60000.0
2   2      Bob  30.0    bob@example.com  2020-02-01 00:00:00  60000.0
3   4  Charlie   NaN           charlie@  2020-03-01 00:00:00  70000.0
4   5    David  22.0                NaN  2020-04-01 00:00:00      NaN

In [71]:
data = pd.read_csv('Messy data set.csv')
data.head()

               ID,Name,Age,Email,JoinDate,Salary
0  1,Alice,25,alice@example.com,2020-01-01,50000
1      2,Bob,30,bob@example.com,not a date,60000
2      2,Bob,30,bob@example.com,2020-02-01,60000
3           4,Charlie,,charlie@,2020-03-01,70000
4                5,David,Twenty-two,,2020-04-01,

In [73]:
duplicates = data[data.duplicated()]  # Select only duplicated rows
print(duplicates)

Empty DataFrame
Columns: [ID,Name,Age,Email,JoinDate,Salary]
Index: []

In [81]:
missing_data = data.isnull().sum()
print("Missing Data")
missing_data

Missing Data

ID          0
Name        1
Age         1
Email       1
JoinDate    0
Salary      1
dtype: int64

In [89]:
 data = data[data['JoinDate'] != 'inconsistent_value']

In [111]:
import pandas as pd
from sklearn.impute import SimpleImputer

# Load Excel file into DataFrame
data = pd.read_excel("Messy data.xlsx")  # Replace 'data.xlsx' with your file name

# Change data type of a specific column (example: converting 'Age' to integer)
data['Age'] = pd.to_numeric(data['Age'], errors='coerce')  # Convert to numeric, handling errors

# Handle missing values using SimpleImputer (Fill with mean for numerical columns)
imputer = SimpleImputer(strategy='mean')
data[['Age']] = imputer.fit_transform(data[['Age']])  # Impute missing values in 'Age'

# Save the cleaned data as CSV
data.to_csv("cleaned_data.csv", index=False)  # Save as CSV without the index

print("Data processing complete! The cleaned file has been saved as 'cleaned_data.csv'.")

Data processing complete! The cleaned file has been saved as 'cleaned_data.csv'.

In [107]:
data = pd.read_excel('Messy data.xlsx')
data.head()
df

   ID     Name   Age               Email             JoinDate    Salary
0   1    Alice  25.0   alice@example.com  2020-01-01 00:00:00   50000.0
1   2      Bob  30.0     bob@example.com           not a date   60000.0
2   2      Bob  30.0     bob@example.com  2020-02-01 00:00:00   60000.0
3   4  Charlie   NaN            charlie@  2020-03-01 00:00:00   70000.0
4   5    David  22.0                 NaN  2020-04-01 00:00:00       NaN
5   6      Eve  45.0         eve@example  2020-05-01 00:00:00   90000.0
6   7    Frank  50.0  frank@@example.com  2020-06-01 00:00:00  100000.0
7   8    Grace  55.0   grace@example.com  2020-07-01 00:00:00  100000.0
8   9    Heidi  60.0   heidi@example.com  2020-08-01 00:00:00  120000.0
9  10      NaN  65.0      10@example.com  2020-09-01 00:00:00  130000.0

In [127]:
data.dtypes

ID            int32
Name         object
Age         float64
Email        object
JoinDate     object
Salary      float64
dtype: object

In [131]:
df['ID'] = pd.to_numeric(df['ID'], errors='coerce')
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')
df['JoinDate'] = pd.to_numeric(df['JoinDate'], errors='coerce')
df['Name'] = df['Name'].astype(str)
df['Email'] = df['Email'].astype(str)

In [135]:
df.dtypes

   ID     Name   Age               Email  JoinDate    Salary
0   1    Alice  25.0   alice@example.com       NaN   50000.0
1   2      Bob  30.0     bob@example.com       NaN   60000.0
2   2      Bob  30.0     bob@example.com       NaN   60000.0
3   4  Charlie   NaN            charlie@       NaN   70000.0
4   5    David  22.0                 nan       NaN       NaN
5   6      Eve  45.0         eve@example       NaN   90000.0
6   7    Frank  50.0  frank@@example.com       NaN  100000.0
7   8    Grace  55.0   grace@example.com       NaN  100000.0
8   9    Heidi  60.0   heidi@example.com       NaN  120000.0
9  10      nan  65.0      10@example.com       NaN  130000.0

In [149]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy='mean')
imputer.fit(df[['Age']])
data[['Age']] = imputer.fit_transform(data[['Age']])

In [147]:
imputer = SimpleImputer(strategy='mean')
imputer.fit(df[['Salary']])
data[['Salary']] = imputer.fit_transform(data[['Salary']])

In [151]:
df.dtypes

ID            int64
Name         object
Age         float64
Email        object
JoinDate    float64
Salary      float64
dtype: object